chillax-backend/app/controllers/compositions_controller.rb

SELECT "compositions".* FROM "compositions"
---
    def index
        compositions = Composition.all

INSERT INTO "compositions" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test 16"], ["user_id", 1], ["created_at", "2019-12-04 11:07:13.466210"], ["updated_at", "2019-12-04 11:07:13.466210"]]
INSERT INTO "composition_sounds" ("volume", "sound_id", "composition_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["volume", 1.0], ["sound_id", 1], ["composition_id", 8], ["created_at", "2019-12-04 11:12:09.876691"], ["updated_at", "2019-12-04 11:12:09.876691"]]
---
    def create
      name = params[params.keys[-5]]
      user_id = params[params.keys[-4]]

      composition = Composition.create(name: name, user_id: user_id)

       # identify the number pof compositon sounds for this compsition
       number_of_sounds = params.keys[0..-6].length

       # => loop over all sounds
       number_of_sounds.times do |index|
          sound_id = params[params.keys[index]]["id"]
          volume = params[params.keys[index]]["volume"]
          CompositionSound.create(sound_id: sound_id, volume: volume, composition_id: composition.id)

SELECT "composition_sounds".* FROM "composition_sounds" WHERE "composition_sounds"."composition_id" = $1  [["composition_id", 11]]
SELECT "sounds".* FROM "sounds" WHERE "sounds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "composition_sounds".* FROM "composition_sounds" WHERE "composition_sounds"."composition_id" = $1  [["composition_id", 23]]
SELECT "compositions".* FROM "compositions" WHERE "compositions"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
DELETE FROM "compositions" WHERE "compositions"."id" = $1  [["id", 23]]
---
    def destroy
        composition_sounds=CompositionSound.where(composition_id: params[:id])
        composition_sounds.each do |cs|
            cs.destroy
        end
        composition = Composition.find(params[:id])
        composition.destroy