chillax-backend/app/controllers/sounds_controller.rb

SELECT "sounds".* FROM "sounds"
---
    def index
        sounds  = Sound.all